#define Max 100
#include<stdio.h>
int main(){
	int N,i,j,sum=0,flag=0,numbflag=0;//输入N个身份证号进行验证 sum记录加权求和的值 
	int wei[]={7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2};//身份证号每位值得权重 17个参数 
	char M[]={'1','0','X','9','8','7','6','5','4','3','2'}; 
	char arr[Max][19];
	scanf("%d",&N);
	for(i=0;i<N;i++){//循环输入参数
		scanf("%s",&arr[i]);
		sum=0;//验证计算单独拿出来进行计算 
		
		for(j=0;j<17;j++){
			if(arr[i][j]<'0'&&arr[i][j]>'9'){ 
				numbflag = 1; 
				break;
			}
			sum += ((arr[i][j]-'0')*wei[j]);
		}
		if(M[sum%11]!=arr[i][17]||numbflag==1){
			arr[i][18]='\0';
			flag=1;
			numbflag = 0;
		}else {
			arr[i][18]='0';
		}
	}
	if(flag==0){
		printf("All passed");
		return 0;
	}else{
		for(i=0;i<N;i++){
			if(arr[i][18]=='\0'){
				printf("%s\n",arr[i]);
			}
		}
	}	
	return 0;
}
/////////////////////////完成~~~去看下道题 

//Z：0 1 2 3 4 5 6 7 8 9 10
//M：1 0 X 9 8 7 6 5 4 3 2
/////这个加权求和 是咋加啊....
//2
//320124198808240056
//110108196711301862

/////容我再去观摩一下身份证验证的计算方法 

//总是在输入第二串参数时 sum的值会累加成负数。。 
//4
//320124198808240056
//12010X198901011234
//110108196711301866
//37070419881216001X
//czxczcxzd23123f1as
//dsa21c0xz1fs24f51z
//141002199602170011

//{7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2}; 



